PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpManualConfigure
****************************************************************************//**
*
* Manually configures a DPLL-HP based on user inputs.
*
* \param pllNum Selects which DPLL-HP to configure.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call this function after changing the PLL input frequency; for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpManualConfigure(uint32_t pllNum, const cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpGetConfiguration
****************************************************************************//**
*
* Reports configuration settings for DPLL-HP.
*
* \param pllNum Selects which DPLL-HP to report.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL data successfully reported \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpGetConfiguration(uint32_t pllNum, cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpEnable
****************************************************************************//**
*
* Enables the DPLL-HP. The PLL should be configured before calling this function.
*
* \param pllNum Selects which DPLL-HP to enable.
*
* \param timeoutus amount of time in microseconds to wait for the PLL to lock.
* If the lock doesn't occur, PLL is stopped. To avoid waiting for lock, set this to 0
* and manually check for lock using \ref Cy_SysClk_PllLocked.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully enabled \n
* CY_SYSCLK_TIMEOUT - Timeout waiting for PLL lock \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpEnable(uint32_t pllNum, uint32_t timeoutus);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected DPLL-HP is enabled.
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* false = disabled \n
* true = enabled
*
*******************************************************************************/
bool Cy_SysClk_DpllHpIsEnabled(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpLocked
****************************************************************************//**
*
* Reports whether or not the selected DPLL-HP is locked.
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* false = not locked \n
* true = locked
*
*******************************************************************************/
bool Cy_SysClk_DpllHpLocked(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpLostLock
****************************************************************************//**
*
* Reports whether or not the selected DPLL-HP lost its lock since the last time this
* function was called. Clears the lost lock indicator.
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* false = did not lose lock \n
* true = lost lock
*
*******************************************************************************/
bool Cy_SysClk_DpllHpLostLock(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpDisable
****************************************************************************//**
*
* Disables the selected DPLL-HP.
*
* \param pllNum Selects which DPLL-HP to disable.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully disabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \sideeffect
* This function sets PLL bypass mode to CY_SYSCLK_FLLPLL_OUTPUT_INPUT.
* If AUTO mode should be used, call \ref Cy_SysClk_DpllHpConfigure or
* \ref Cy_SysClk_DpllHpManualConfigure before calling \ref Cy_SysClk_DpllHpEnable.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpDisable(uint32_t pllNum);

/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpGetFrequency
****************************************************************************//**
*
* Gets the frequency of DPLL-HP
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* DPLL-LP Frequency
*
*******************************************************************************/
uint32_t Cy_SysClk_DpllHpGetFrequency(uint32_t pllNum);

#endif // defined(CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)
#endif // defined(CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL)) || defined(CY_DOXYGEN)


/** \} group_sysclk_pll_funcs */

#endif

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/* ========================================================================== */
/* ===========================    IHO SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_iho_funcs
* \{
*/

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)

