PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_IhoEnable
****************************************************************************//**
*
* Enables the IHO.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Take into account the possible platform specific clkHf (and further
* clocking chain links) frequency limitations while using this API.
*
*******************************************************************************/
void Cy_SysClk_IhoEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IhoIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected IHO is enabled.
*
* \return
* false = disabled \n
* true = enabled
*
*******************************************************************************/
bool Cy_SysClk_IhoIsEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDisable
****************************************************************************//**
*
* Disables IHO.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
*******************************************************************************/
void Cy_SysClk_IhoDisable(void);

#endif

#if defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepEnable
****************************************************************************//**
*
* Enables the IHO during deepsleep mode
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS IP.
*
*******************************************************************************/
void Cy_SysClk_IhoDeepsleepEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IhoIsDeepsleepEnabled
****************************************************************************//**
*
* Reports whether or not the selected IHO is enabled during deepsleep mode.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS IP.
*
*******************************************************************************/
bool Cy_SysClk_IhoIsDeepsleepEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepDisable
****************************************************************************//**
*
* Disables IHO during deepsleep mode.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS IP.
*
*******************************************************************************/
void Cy_SysClk_IhoDeepsleepDisable(void);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepDisable
****************************************************************************//**
*
* Set the trim value for IHO.
*
* \param trimVal Trim value to be set for IHO.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS IP.
*
*******************************************************************************/
void Cy_SysClk_IhoSetTrim(uint32_t trimVal);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepDisable
****************************************************************************//**
*
* Get the trim value configured for IHO.
*
* \return
* Configured IHO Trim value.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS IP.
*
*******************************************************************************/
uint32_t Cy_SysClk_IhoGetTrim(void);


#endif/* CY_IP_MXS22SRSS*/

/** \} group_sysclk_iho_funcs */
#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)*/





/* ========================================================================== */
/* ===========================    PILO SECTION    =========================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_pilo_funcs
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysClk_PiloEnable
****************************************************************************//**
*
* Enables the PILO.
*
* \note This function blocks for 1 millisecond between enabling the PILO and
* releasing the PILO reset.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloEnable
*
*******************************************************************************/
void Cy_SysClk_PiloEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_PiloIsEnabled
****************************************************************************//**
*
* Reports the Enabled/Disabled status of the PILO.
*
* \return Boolean status of PILO: true - Enabled, false - Disabled.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloDisable
*
*******************************************************************************/
bool Cy_SysClk_PiloIsEnabled(void);


/*******************************************************************************
* Function Name: Cy_SysClk_PiloDisable
****************************************************************************//**
*
* Disables the PILO.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloDisable
*
*******************************************************************************/
void Cy_SysClk_PiloDisable(void);




/** \} group_sysclk_pilo_funcs */



/* ========================================================================== */
/* ==========================    ALTLF SECTION    =========================== */
/* ========================================================================== */
/** \cond For future usage */
uint32_t Cy_SysClk_AltLfGetFrequency(void);
bool Cy_SysClk_AltLfIsEnabled(void);
/** \endcond  */


/* ========================================================================== */
/* ====================    CLOCK MEASUREMENT SECTION    ===================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_calclk_enums
* \{
*/
/** Defines all possible clock sources */
#if defined(CY_IP_MXS22SRSS)
typedef enum
{
    CY_SYSCLK_MEAS_CLK_NC =                0U,
    CY_SYSCLK_MEAS_CLK_ILO =               1U,
    CY_SYSCLK_MEAS_CLK_WCO =               2U,
    CY_SYSCLK_MEAS_CLK_BAK =               3U,
    CY_SYSCLK_MEAS_CLK_ALTLF =             4U,
    CY_SYSCLK_MEAS_CLK_LFCLK =             5U,
    CY_SYSCLK_MEAS_CLK_IMO =               6U,
    CY_SYSCLK_MEAS_CLK_SLPCTRL =           7U,
    CY_SYSCLK_MEAS_CLK_PILO =              8U,
    CY_SYSCLK_MEAS_CLK_ECO_PRESCALER =     9U,
    CY_SYSCLK_MEAS_CLK_MF =                10U,
    CY_SYSCLK_MEAS_CLK_FAST_CLKS =         0x100U,
    CY_SYSCLK_MEAS_CLK_IHO =               0x101U,
    CY_SYSCLK_MEAS_CLK_EXT =               0x102U,
    CY_SYSCLK_MEAS_CLK_ECO =               0x103U,
    CY_SYSCLK_MEAS_CLK_ALTHF0 =            0x105U,
    CY_SYSCLK_MEAS_CLK_ALTHF1 =            0x106U,
    CY_SYSCLK_MEAS_CLK_TIMERCLK =          0x108U,
    CY_SYSCLK_MEAS_CLK_PATH_CLKS =         0x900U,
    CY_SYSCLK_MEAS_CLK_PATH0 =             0x900U,
    CY_SYSCLK_MEAS_CLK_PATH1 =             0x901U,
    CY_SYSCLK_MEAS_CLK_PATH2 =             0x902U,
    CY_SYSCLK_MEAS_CLK_PATH3 =             0x903U,
    CY_SYSCLK_MEAS_CLK_PATH4 =             0x904U,
    CY_SYSCLK_MEAS_CLK_PATH5 =             0x905U,
    CY_SYSCLK_MEAS_CLK_PATH6 =             0x906U,
    CY_SYSCLK_MEAS_CLK_PATH7 =             0x907U,
    CY_SYSCLK_MEAS_CLK_PATH8 =             0x908U,
    CY_SYSCLK_MEAS_CLK_PATH9 =             0x909U,
    CY_SYSCLK_MEAS_CLK_PATH10 =            0x90AU,
    CY_SYSCLK_MEAS_CLK_PATH11 =            0x90BU,
    CY_SYSCLK_MEAS_CLK_PATH12 =            0x90CU,
    CY_SYSCLK_MEAS_CLK_PATH13 =            0x90DU,
    CY_SYSCLK_MEAS_CLK_PATH14 =            0x90EU,
    CY_SYSCLK_MEAS_CLK_PATH15 =            0x90FU,
    CY_SYSCLK_MEAS_CLK_CLKHFS =            0xA00U,
    CY_SYSCLK_MEAS_CLK_CLKHF0 =            0xA00U,
    CY_SYSCLK_MEAS_CLK_CLKHF1 =            0xA01U,
    CY_SYSCLK_MEAS_CLK_CLKHF2 =            0xA02U,
    CY_SYSCLK_MEAS_CLK_CLKHF3 =            0xA03U,
    CY_SYSCLK_MEAS_CLK_CLKHF4 =            0xA04U,
    CY_SYSCLK_MEAS_CLK_CLKHF5 =            0xA05U,
    CY_SYSCLK_MEAS_CLK_CLKHF6 =            0xA06U,
    CY_SYSCLK_MEAS_CLK_CLKHF7 =            0xA07U,
    CY_SYSCLK_MEAS_CLK_CLKHF8 =            0xA08U,
    CY_SYSCLK_MEAS_CLK_CLKHF9 =            0xA09U,
    CY_SYSCLK_MEAS_CLK_CLKHF10 =           0xA0AU,
    CY_SYSCLK_MEAS_CLK_CLKHF11 =           0xA0BU,
    CY_SYSCLK_MEAS_CLK_CLKHF12 =           0xA0CU,
    CY_SYSCLK_MEAS_CLK_CLKHF13 =           0xA0DU,
    CY_SYSCLK_MEAS_CLK_CLKHF14 =           0xA0EU,
    CY_SYSCLK_MEAS_CLK_CLKHF15 =           0xA0FU,
    CY_SYSCLK_MEAS_CLK_LAST_CLK =          0xA10U
} cy_en_meas_clks_t;
#endif
/** \} group_sysclk_calclk_enums */

/**
* \addtogroup group_sysclk_calclk_structs
* \{
*/
#if (defined(CY_DEVICE_SECURE))
/** PRA structure for Cy_SysClk_StartClkMeasurementCounters function parameters */
typedef struct
{
    cy_en_meas_clks_t clock1;        /**< clock1 */
    uint32_t          count1;        /**< count  */
    cy_en_meas_clks_t clock2;        /**< clock2 */
} cy_stc_pra_start_clk_measurement_t;

