PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupGetDivider
****************************************************************************//**
*
* Gets the divider value for a particular group
*
* \return Divider value
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* enum en_peri_grp_t
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriGroupGetDivider(uint32_t groupNum);


/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSetSlaveCtl
****************************************************************************//**
*
* Sets the particular Slave Control value for a particular group
*
* \return \ref cy_en_sysclk_status_t
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* enum en_peri_grp_t
*
* \param slaveCtl Selects the Slave Control Register Number
*
* \param value Value to be written
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriGroupSetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t value);

/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupGetSlaveCtl
****************************************************************************//**
*
* Gets the particular Slave Control value for a particular group
*
* \return Slave Control register value for a particular group
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* enum en_peri_grp_t
*
* \param slaveCtl Selects the Slave Control Register Number
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriGroupGetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl);

/*******************************************************************************
* Function Name: Cy_SysClk_IsPeriGroupSlaveCtlSet
****************************************************************************//**
*
* Gets the mask value of particular slave control register for a particular group
*
* \return Divider value
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* enum en_peri_grp_t
*
* \param slaveCtl Selects the Slave Control Register Number
*
* \param slaveMsk Selects the bit position(s) that needs to be obtained
*
*******************************************************************************/
bool Cy_SysClk_IsPeriGroupSlaveCtlSet(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t slaveMsk);

#if defined (CY_IP_MXS22SRSS)
/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSlaveInit
****************************************************************************//**
*
* Initializes an IP
*
* \param periNum Selects the PERI Number
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* enum en_peri_grp_t
*
* \param slaveNum Selects the bit position of the IP that needs to be enabled
*
* \param clkHfNum Selects the CLK_HF number that needs to be enabled for
* the IP to get enabled.
*
*******************************************************************************/
void Cy_SysClk_PeriGroupSlaveInit(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum, uint32_t clkHfNum);

/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSlaveDeinit
****************************************************************************//**
*
* Deinitializes an IP
*
* \param periNum Selects the PERI Number
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* enum en_peri_grp_t
*
* \param slaveNum Selects the bit position of the IP that needs to be disabled
*
*******************************************************************************/
void Cy_SysClk_PeriGroupSlaveDeinit(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum);

/*******************************************************************************
* Function Name: Cy_SysClk_IsPeriGroupSlaveEnabled
****************************************************************************//**
*
* Checks if a Slave Peripheral is enabled or not
*
* \param periNum Selects the PERI Number
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* en_peri_grp_t
*
* \param slaveNum Selects the bit position of the IP that needs to be disabled
*
* \return The divider value.
* true - if slave is enabled, false - otherwise
*
*******************************************************************************/
bool Cy_SysClk_IsPeriGroupSlaveEnabled(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum);

#endif /* defined (CY_IP_MXS22SRSS) */

/** \} group_sysclk_clk_peripheral_group_funcs */
#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXPERI_VERSION >= 3))  || defined (CY_IP_MXS22SRSS) */

/* ========================================================================== */
/* ========================    clk_peri SECTION    ========================== */
/* ========================================================================== */

/* ========================================================================== */
/* =====================    clk_peripherals SECTION    ====================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_clk_peripheral_enums
* \{
*/
/** Programmable clock divider types */
typedef enum
{
    CY_SYSCLK_DIV_8_BIT    = 0U, /**< Divider Type is an 8 bit divider */
    CY_SYSCLK_DIV_16_BIT   = 1U, /**< Divider Type is a 16 bit divider */
    CY_SYSCLK_DIV_16_5_BIT = 2U, /**< Divider Type is a 16.5 bit fractional divider */
    CY_SYSCLK_DIV_24_5_BIT = 3U  /**< Divider Type is a 24.5 bit fractional divider */
} cy_en_divider_types_t;
/** \} group_sysclk_clk_peripheral_enums */


/**
* \addtogroup group_sysclk_clk_peripheral_funcs
* \{
*/
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_IP_MXS22SRSS)

